simple_case/pitzDaily/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          fluid;//incompressibleFluid; "fluid" is for compressible flows. Mutliple solvers are compatible with this key word.

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.3;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   0.01; 

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes; // When "yes", you can manually change the timpe step during the simulation

adjustTimeStep  yes; // The time step will automatically adapt to match the defined courant number "maxCo".

maxCo           5;

// ************************************************************************* //
